[
    {
        "Activity_Id": 2,
        "UC_Type": "Extracurricular Activity",
        "Organization_Program_Course_Name": "Finance Tracker Website",
        "Desc": "Successfully developed the Personal Finance Tracker website by defining goals, key features like income tracking and budgeting, and creating a project roadmap. Completed on August 30, 2023, the project followed IgniteCS Expo rules, and the demo presentation earned third place.",
        "What_You_Did": null,
        "Grade": "9,10,11",
        "Hours_Spent_Per_Week": "5",
        "Weeks_Spent_Per_Year": "20",
        "Working_Place": null,
        "Job_Title": null,
        "Job_Responsibility": null,
        "Still_Work": null,
        "Activity_Order": 6
    },
    {
        "Activity_Id": 1,
        "UC_Type": "Extracurricular Activity",
        "Organization_Program_Course_Name": "Club President, Computer Club",
        "Desc": "Recruited 40 members, raised $150 through a boba fundraiser, paired mentors and mentees, and received the 2023 Club Activity Award. Upcoming plans include hosting Python workshops, inviting tech industry professionals for career talks, and organizing showcase events for the Computer Club.",
        "What_You_Did": null,
        "Grade": "9,10,11",
        "Hours_Spent_Per_Week": "2",
        "Weeks_Spent_Per_Year": "30",
        "Working_Place": null,
        "Job_Title": null,
        "Job_Responsibility": null,
        "Still_Work": null,
        "Activity_Order": 7
    },
    {
        "Activity_Id": 5,
        "UC_Type": "Working Experience",
        "Organization_Program_Course_Name": null,
        "Desc": "During my remote IT internship, I completed onboarding, assessed the password management system, evaluated tools, and implemented a company-wide solution. I conducted training and facilitated a secure migration, earning 2023 Summer Internship award",
        "What_You_Did": null,
        "Grade": "10",
        "Hours_Spent_Per_Week": "",
        "Weeks_Spent_Per_Year": "",
        "Working_Place": "Leyu Intelligent Technology Co., Ltd",
        "Job_Title": "Software developer",
        "Job_Responsibility": "As a Remote IT Intern, I completed onboarding and orientation, assessed the existing password management system, and evaluated tools for features, security, and pricing. I implemented a company-wide password management system, conducted training, and facilitated a secure migration. I also created a user support system and software manual.",
        "Still_Work": "Yes",
        "Activity_Order": 8
    },
    {
        "Activity_Id": 3,
        "UC_Type": "Volunteer",
        "Organization_Program_Course_Name": "Kumon Learning Center",
        "Desc": "Kumon Learning Center is an educational franchise offering personalized math and reading programs for children. Founded by Toru Kumon in Japan, it emphasizes self-paced learning to build essential skills and confidence.",
        "What_You_Did": "I conducted a pre-event math assessment to evaluate skills, delivered a math workshop, and organized small group problem-solving sessions. I received the Bronze Prize for the President Volunteer Award. Upcoming tasks include checking events, gathering feedback, and awarding certificates to recognize participants' achievements.",
        "Grade": "9,10,11",
        "Hours_Spent_Per_Week": "2",
        "Weeks_Spent_Per_Year": "45",
        "Working_Place": null,
        "Job_Title": null,
        "Job_Responsibility": null,
        "Still_Work": null,
        "Activity_Order": 9
    },
    {
        "Activity_Id": 4,
        "UC_Type": "Other Coursework",
        "Organization_Program_Course_Name": "Introduction to data science course",
        "Desc": "This course offers an in-depth introduction to data science, focusing on key concepts, tools, and techniques. We'll cover data analysis, visualization, and machine learning using Python and R, while gaining hands-on experience in data collection, cleaning, and statistical methods for real-world applications.",
        "What_You_Did": null,
        "Grade": "9",
        "Hours_Spent_Per_Week": "6",
        "Weeks_Spent_Per_Year": "16",
        "Working_Place": null,
        "Job_Title": null,
        "Job_Responsibility": null,
        "Still_Work": null,
        "Activity_Order": 10
    },
    {
        "Activity_Id": 6,
        "UC_Type": "Extracurricular Activity",
        "Organization_Program_Course_Name": "School Varsity Swim Team",
        "Desc": "As Captain of the Varsity Swim Team, I earned the Swimming Team Spirit Award by organizing meetings, mentoring younger swimmers, and planning fundraisers. I coordinated a workshop with a sports psychologist and participated in championships. Upcoming tasks include academic support and end-of-season events.",
        "What_You_Did": null,
        "Grade": "11,12",
        "Hours_Spent_Per_Week": "6",
        "Weeks_Spent_Per_Year": "45",
        "Working_Place": null,
        "Job_Title": null,
        "Job_Responsibility": null,
        "Still_Work": null,
        "Activity_Order": 11
    }
]